ArmstrongSubero/PIC16-Projects/33_Motor_BTS7960.X/main.c
/*
 * File: main.c
 * Author: Armstrong Subero
 * PIC: 16F1719 w/int OSC @ 32MHz, 5v
 * Program: 15_PWM
 * Compiler: XC8 (v2.45, MPLAX X v6.15)
 * Program Version: 1.2
 *                
 * Program Description: This generates a PWM signal on pins RB0 and RB1
 * 
 * Hardware Description: An Oscilloscope probe is connected to pins RB0 and RB1
 *                       
 * Created November 4th, 2016, 1:00 PM
 * Last Updated: November 18th, 2023, 4:36 AM
 */


/*******************************************************************************
 *Includes and defines
 ******************************************************************************/
#include "PIC16F1719_Internal.h"

/*******************************************************************************
 * Function: void initMain()
 *
 * Returns: Nothing
 *
 * Description: Contains initializations for main
 * 
 * Usage: initMain()
 ******************************************************************************/

void initMain(){
    // Run at 32 MHz
    internal_32();
    
    ////////////////////
    // Configure Ports
    ///////////////////
    TRISDbits.TRISD1 = 0;
    
    // Set PIN B0 as output
    TRISBbits.TRISB0 = 0;
    
    // Set PIN B1 as output
    TRISBbits.TRISB1 = 0;
    
    // Turn off analog
    ANSELB = 0;
    
    /////////////////////
    // Configure Timer6
    /////////////////////
    
    // Select PWM timer as Timer6 for CCP1 and CCP2
    CCPTMRSbits.C1TSEL = 0b10;
    CCPTMRSbits.C2TSEL = 0b10;
    
 
    // Enable timer Increments every 125 ns (32 MHz clock) 1000/(32/4)
    // Period = 256 x 0.125 us = 31.25 us
    
    //                          Crystal Frequency 
    //    PWM Freq  = ----------------------------------------- 
    //                  (PRX + 1) * (TimerX Prescaler) * 4
    
    //    PWM Frequency = 32 000 000 / 256 * 1 * 4
    //    PWM Frequency = 31.250 kHz
    
    // Prescale = 1
    T6CONbits.T6CKPS = 0b00;
    
    // Enable Timer6
    T6CONbits.TMR6ON = 1;
    
    // Set timer period
    PR6 = 255;
    
    //////////////////////////
    // Configure PWM
    /////////////////////////
    
    // Configure CCP1
     
    // LSB's of PWM duty cycle = 00
    CCP1CONbits.DC1B = 00;
    
    // Select PWM mode
    CCP1CONbits.CCP1M = 0b1100;
    
    // Configure CCP2
    
    // LSB's of PWM duty cycle = 00
    CCP2CONbits.DC2B = 00;
    
    // Select PWM mode
    CCP2CONbits.CCP2M = 0b1100;
    
    
    //////////////////////////////
    // Configure PPS
    /////////////////////////////
    
    PPSLOCK = 0x55;
    PPSLOCK = 0xAA;
    PPSLOCKbits.PPSLOCKED = 0x00; // unlock PPS
    
    // Set RB0 to PWM1
    RB0PPSbits.RB0PPS = 0b01100;
    
    // Set RB1 to PWM2
    RB1PPSbits.RB1PPS = 0b01101;
    
    PPSLOCK = 0x55;
    PPSLOCK = 0xAA;
    PPSLOCKbits.PPSLOCKED = 0x01; // lock PPS
    
    TRISDbits.TRISD0 = 0;
    TRISDbits.TRISD1 = 0;  
}

void leftEnable(void)
{
   LATDbits.LATD0 = 1; 
}

void leftDisable(void)
{
    LATDbits.LATD0 = 0;
}

void rightEnable(void)
{
    LATDbits.LATD1 = 1;
}

void rightDisable(void)
{
    LATDbits.LATD1 = 0;
}

void rightPWMDuty(uint16_t duty)
{
    CCPR1L = duty;
}

void leftPWMDuty(uint16_t duty)
{
    CCPR2L = duty;
}

void motorTurnLeft(uint16_t motorSpeed)
{
   leftEnable();
   rightEnable();
   
   // turn off left PWM 
   leftPWMDuty(0);
   
   // turn on right PWM
   rightPWMDuty(motorSpeed);
}

void motorTurnRight(uint16_t motorSpeed)
{
   leftEnable();
   rightEnable();
   
   // turn off left PWM 
   leftPWMDuty(motorSpeed);
   
   // turn on right PWM
   rightPWMDuty(0);
    
}

void motorStop(void)
{
   leftDisable();
   rightDisable();
   
   // turn off left PWM 
   leftPWMDuty(0);
   
   // turn on right PWM
   rightPWMDuty(0);
    
}

/*******************************************************************************
 * Function: Main
 *
 * Returns: Nothing
 *
 * Description: Program entry point
 ******************************************************************************/

void main(void) {
    initMain();

    while(1)
    {
        motorTurnLeft(192);
        __delay_ms(3000);
        
        motorStop();
        __delay_ms(3000);
        
        motorTurnRight(192);
        __delay_ms(3000);
        
        motorStop();
        __delay_ms(3000);
    }
     return;    
}